# Lambda Function with filter and map

In [2]:
ages = [13, 90, 17, 59, 21, 60, 5]
 
adults = list(filter(lambda age: age > 18, ages))
 
print(adults)

[90, 59, 21, 60]

In [3]:
animals = ['dog', 'cat', 'parrot', 'rabbit']

upper_animals = list(map(lambda animal: animal.upper(), animals))

print(upper_animals)

['DOG', 'CAT', 'PARROT', 'RABBIT']

In [12]:
bikes = ["rx100", "rs 200", "H2R", "vitpelin", "S1000RR", "RR 310"]

filter_name = list(filter(lambda name: name.startswith('S'), bikes))

print(filter_name)

['S1000RR']

In [13]:
celsius_temps = [0, 10, 20, 30, 40]
fahrenheit_temps = list(map(lambda c: (c * 9/5) + 32, celsius_temps))
print(fahrenheit_temps)

[32.0, 50.0, 68.0, 86.0, 104.0]

## Definition and Usage
-  The query() method allows you to query the DataFrame.

-  The query() method takes a query expression as a string parameter, which has to evaluate to either True of False.

-  It returns the DataFrame where the result is True according to the query expression.

## syntax
-  dataframe.query(expr, inplace)

## Parameters:

-  expr: Expression in string form to filter data.
-  inplace: Make changes in the original data frame if True
-  kwargs: Other keyword arguments.
-  Return type: Filtered Data frame

In [3]:
import pandas as pd
employee_data = pd.read_csv("employees.csv")

In [4]:
employee_data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [17]:
import pandas as pd
employee_data = pd.read_csv("employees.csv")
employee_data.columns = [column.replace(" ", "_") for column in employee_data.columns] 
employee_data.query('Senior_Management == True and First_Name == "Johnny"', inplace=True)

In [18]:
employee_data

,First_Name,Gender,Start_Date,Last_Login_Time,Salary,Bonus_%,Senior_Management,Team
71,Johnny,Male,11/6/2009,4:23 PM,118172,16.194,True,Sales
413,Johnny,Male,9/14/1992,8:21 AM,115194,5.861,True,Marketing
496,Johnny,Male,2/26/2016,7:39 PM,76394,5.437,True,Marketing
566,Johnny,Male,1/8/1995,1:35 PM,91124,12.986,True,Distribution
829,Johnny,Male,1/14/2007,2:54 PM,71383,2.097,True,Human Resources